PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
    case CMD_STREAM_START:
    {
        if (!Slave_VerifyCmdAuthAndStoreNonce(req)) {
            uint8_t st = PROTO_STATUS_ERR_ID_MISMATCH;
            slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
            break;
        }

        if (req->payload_len < (uint8_t)(PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN + 2U)) {
            uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
            slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
            break;
        }

        g_stream_interval_ms = req->payload[PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN];
        g_stream_remaining_frames = req->payload[PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN + 1U];
        if (g_stream_interval_ms == 0U) {
            g_stream_interval_ms = 20U;
        }
        g_stream_enabled = (g_stream_remaining_frames > 0U);
        g_stream_seq = 0U;
        g_last_stream_tx_tick = HAL_GetTick();

        uint8_t st = PROTO_STATUS_OK;
        slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
        break;
    }

    case CMD_STREAM_STOP:
    {
        g_stream_enabled = false;
        g_stream_remaining_frames = 0U;
        uint8_t st = PROTO_STATUS_OK;
        slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
        break;
    }

    case CMD_STREAM_NACK:
    {
        /* Optional/low-frequency path: default ACK-only profile keeps
         * behavior simple and power-efficient. We only acknowledge receipt. */
        uint8_t st = PROTO_STATUS_OK;
        slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
        break;
    }

    case CMD_DATA_WRITE:
    {
        /* DATA_WRITE args profile (runtime stream config):
         *   args[0] = STREAM_CFG_SUBCMD (0x01)
         *   args[1] = interval_ms
         *   args[2] = frame_count
         */
        uint8_t status = PROTO_STATUS_ERR_UNKNOWN_CMD;
        if (req->payload_len >= (uint8_t)(PROTO_CMD_ARGS_OFFSET + 3U)) {
            const uint8_t *args = &req->payload[PROTO_CMD_ARGS_OFFSET];
            if (args[0] == STREAM_CFG_SUBCMD) {
                uint8_t iv = args[1];
                uint8_t fc = args[2];
                g_stream_interval_ms = (iv == 0U) ? 20U : iv;
                g_stream_remaining_frames = fc;
                status = PROTO_STATUS_OK;
            }
        }
        slave_build_cmd_response(resp, CMD_DATA_ACK, &status, 1U);
        break;
    }

    case CMD_SLEEP_CMD:
        slave_build_cmd_response(resp, CMD_SLEEP_ACK, NULL, 0U);
        break;

    case CMD_KEEPALIVE:
        slave_build_cmd_response(resp, CMD_KEEPALIVE_ACK, NULL, 0U);
        break;

    default:
    {
        uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
        slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
        break;
    }
    }

    return 0;
}

static void Slave_SendResponse(const Proto_Packet *resp, uint8_t channel)
{
    uint8_t tx_buf[CC1101_PKT_MAX_LEN];
    uint8_t tx_len = Proto_BuildPacket(resp, tx_buf, sizeof(tx_buf));
    if (tx_len == 0U) {
        return;
    }

    /* Slave responds on the channel Master selected (Master already cleared
     * it via LBT). Use SendPacketLBT with threshold=-120 dBm so the CCA
     * always passes (effectively direct send). */
    (void)CC1101_SendPacketLBT(&g_cc1101, channel,
                               tx_buf, tx_len,
                               -120, 1U, 200U);
}

static int Slave_HandleMICSSession(void)
{
    uint8_t rx_buf[CC1101_PKT_MAX_LEN];
    uint8_t rx_len = 0U;
    Proto_Packet req_pkt, resp_pkt;
    bool session_active = true;
    uint32_t session_start = HAL_GetTick();
    g_slave_pwr_trace.mics_session_count++;
    g_slave_pwr_trace.last_session_start_ms = session_start;

    /* Guard: a valid channel must have been assigned in the wake-up beacon */
    if (g_active_channel >= CC1101_MICS_NUM_CHANNELS) {
        return -1;
    }

    /* Initialize CC1101 for MICS communication */
    CC1101_WakeFromSleep(&g_cc1101);
    CC1101_InitMICSLike26MHz(&g_cc1101);

    /* CC2500 is not needed during active 400 MHz session.
     * Put it into deep sleep to cut parallel radio current. */
    (void)CC2500_EnterSleep(&g_cc2500);

    while (session_active) {
        /* Check session timeout */
        if ((HAL_GetTick() - session_start) > PROTO_SESSION_TIMEOUT_MS) {
            g_slave_pwr_trace.mics_timeout_count++;
            break;
        }

        /* Tune to the channel the Master pre-selected via LBT - no scanning */
        CC1101_Status st = CC1101_WaitAndReadPacket(&g_cc1101,
                                                    g_active_channel,
                                                    rx_buf, &rx_len,
                                                    sizeof(rx_buf),
                                                    SLAVE_MICS_RX_WINDOW_MS);
        if (st != CC1101_OK) {
            if (g_stream_enabled &&
                ((HAL_GetTick() - g_last_stream_tx_tick) >= g_stream_interval_ms)) {
                Proto_Packet stream_pkt;
                uint8_t stream_body[AUTH_ARG_LEN + 1U + sizeof(g_sensor_data)];
                uint8_t stream_body_len = Slave_BuildStreamDataBody(stream_body, sizeof(stream_body));
                if (stream_body_len > 0U) {
                    stream_pkt.fcf = Proto_FCF_Make(MICS_FCF_TYPE_DATA, false, false);
                    stream_pkt.seq = g_seq++;
                    stream_pkt.sess = g_session_id;
                    stream_pkt.payload_len = Proto_BuildDataPayload(MICS_DTYPE_ECG_DELTA,
                                                                    g_my_id,
                                                                    g_authorized_master_id,
                                                                    stream_body,
                                                                    stream_body_len,
                                                                    stream_pkt.payload,
                                                                    sizeof(stream_pkt.payload));
                    if (stream_pkt.payload_len > 0U) {
                        Slave_SendResponse(&stream_pkt, g_active_channel);
                        g_last_stream_tx_tick = HAL_GetTick();
                        if (g_stream_remaining_frames > 0U) {
                            g_stream_remaining_frames--;
                            if (g_stream_remaining_frames == 0U) {
                                g_stream_enabled = false;
                            }
                        }
                    }
                }
            }
            continue;
        }

